Tekla.Structures.AnalysisInternal.AnalysisChangeManagement.PartDiff
Part differences.

Tekla.Structures.AnalysisInternal.AnalysisChangeManagement.PartDiff.PartId
Gets or sets the part identifier.

Tekla.Structures.AnalysisInternal.AnalysisChangeManagement.PartDiff.PosX
Gets or sets the position X differences.

Tekla.Structures.AnalysisInternal.AnalysisChangeManagement.PartDiff.PosYz
Gets or sets the position YZ differences.

Tekla.Structures.AnalysisInternal.AnalysisChangeManagement.PartDiff.PosXyz
Gets or sets the position XYZ differences.

Tekla.Structures.AnalysisInternal.AnalysisChangeManagement.PartDiff.Rotation
Gets or sets the rotation differences.

Tekla.Structures.AnalysisInternal.AnalysisChangeManagement.PartDiff.Profile
Gets or sets the profile differences.

Tekla.Structures.AnalysisInternal.AnalysisChangeManagement.PartDiff.Material
Gets or sets the material differences.

Tekla.Structures.AnalysisInternal.AnalysisChangeManagement.PartDiff.Count
Gets the count of differences.
Returns: The count of differences.